app/controllers/carts_controller.rb

INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2014-04-20 15:33:48', '2014-04-20 15:33:48')
---
  def create
    @cart = Cart.new(cart_params)

    respond_to do |format|
      if @cart.save

SELECT `carts`.* FROM `carts` WHERE `carts`.`id` = 980190962 LIMIT 1
---
    def set_cart
      @cart = Cart.find(params[:id])