app/controllers/line_items_controller.rb

SELECT `line_items`.* FROM `line_items`
---
  def index
    @line_items = LineItem.all

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2014-04-20 15:36:07', '2014-04-20 15:36:07')
INSERT INTO `line_items` (`cart_id`, `created_at`, `product_id`, `updated_at`) VALUES (1, '2014-04-20 15:36:07', 1, '2014-04-20 15:36:07')
UPDATE `line_items` SET `quantity` = 2, `updated_at` = '2014-04-21 01:33:03' WHERE `line_items`.`id` = 3
---
  def create
    product = Product.find(params[:product_id])
    @line_item =@cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save

DELETE FROM `line_items` WHERE `line_items`.`id` = 35
---
  def destroy
    @cart = @line_item.cart
    @line_item.destroy

SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`id` = 35 LIMIT 1
---
    def set_line_item
      @line_item = LineItem.find(params[:id])