app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)

    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2014-04-21 09:23:03', '2014-04-21 09:23:03')

  def destroy
    @order.destroy
---
DELETE FROM `orders` WHERE `orders`.`id` = 980190962

    def set_order
      @order = Order.find(params[:id])
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 980190962 LIMIT 1