app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT `orders`.* FROM `orders`

  def new
    if @cart.line_items.empty?
---
SELECT 1 AS one FROM `line_items` WHERE `line_items`.`cart_id` = 23 LIMIT 1
SELECT `line_items`.* FROM `line_items` WHERE `line_items`.`cart_id` = 23

  def create
    @order = Order.new(order_params)

    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO `orders` (`address`, `created_at`, `email`, `name`, `pay_type`, `updated_at`) VALUES ('abc', '2014-04-21 09:51:16', 'dp90219@gmail.com', 'liupeng', 'Check', '2014-04-21 09:51:16')
DELETE FROM `carts` WHERE `carts`.`id` = 23