app/controllers/products_controller.rb

SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
---
    def set_product
      @product = Product.find(params[:id])