app/controllers/products_controller.rb

INSERT INTO `products` (`created_at`, `description`, `image_url`, `price`, `title`, `updated_at`) VALUES ('2014-04-20 12:15:14', 'Wibbles are fun!', 'lorem.jpg', 19.95, 'Lorem Ipsum', '2014-04-20 12:15:14')
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE `products` SET `title` = 'Lorem Ipsum', `description` = 'Wibbles are fun!', `image_url` = 'lorem.jpg', `price` = 19.95, `updated_at` = '2014-04-20 12:15:15' WHERE `products`.`id` = 980190962
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM `products` WHERE `products`.`id` = 980190962
---
  def destroy
    @product.destroy

SELECT `products`.* FROM `products` WHERE `products`.`id` = 980190962 LIMIT 1
---
    def set_product
      @product = Product.find(params[:id])