app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
    def set_user
      @user = User.find(params[:id])