app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY `users`.`name` ASC
---
  def index
    @users = User.order(:name)

INSERT INTO `users` (`created_at`, `name`, `password_digest`, `updated_at`) VALUES ('2014-04-21 12:23:23', 'liupeng', '$2a$10$CfrKDq0MBWMMgdVB.ghkP.3rFQBKxrS1KeRtv3iX0M1e3G.RaRike', '2014-04-21 12:23:23')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save